Revit 2026 API

# MarbleMarbleColor2 Property

---

The property labeled "Vein Color" from the "Marble" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MarbleColor2 { get; }
```
```vb
Public Shared ReadOnly Property MarbleColor2 As String
	Get
```
```cpp
public:
static property String^ MarbleColor2 {
	String^ get ();
}
```
```fsharp
static member MarbleColor2 : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

Marble Class

Autodesk.Revit.DB.Visual Namespace